podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/LMEM_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
      MK82F25615
-->
      <peripheral>
         <?sourceFile "LMEM_MK28F15" ?>
         <name>LMEM</name>
         <description>Local Memory Controller</description>
         <groupName>LMEM</groupName>
         <headerStructName>LMEM</headerStructName>
         <baseAddress>0xE0082000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x800</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x820</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PCCCR</name>
               <description>Cache control register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ENCACHE</name>
                     <description>Cache enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Cache disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENWRBUF</name>
                     <description>Enable Write Buffer</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Write buffer disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write buffer enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PCCR2</name>
                     <description>Forces all cacheable spaces to write through</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCCR3</name>
                     <description>Forces no allocation on cache misses (must also have PCCR2 asserted)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVW0</name>
                     <description>Invalidate Way 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>When setting the GO bit, invalidate all lines in way 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PUSHW0</name>
                     <description>Push Way 0</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>When setting the GO bit, push all modified lines in way 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVW1</name>
                     <description>Invalidate Way 1</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>When setting the GO bit, invalidate all lines in way 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PUSHW1</name>
                     <description>Push Way 1</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>When setting the GO bit, push all modified lines in way 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GO</name>
                     <description>Initiate Cache Command</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Write: no effect. Read: no cache command active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write: initiate command indicated by bits 27-24. Read: cache command active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCCLCR</name>
               <description>Cache line control register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>LGO</name>
                     <description>Initiate Cache Line Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Write: no effect. Read: no line command active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write: initiate line command indicated by bits 27-24. Read: line command active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CACHEADDR</name>
                     <description>Cache address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>WSEL</name>
                     <description>Way select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Way 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Way 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDSEL</name>
                     <description>Tag/Data Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Data</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tag</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LCIVB</name>
                     <description>Line Command Initial Valid Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LCIMB</name>
                     <description>Line Command Initial Modified Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LCWAY</name>
                     <description>Line Command Way</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LCMD</name>
                     <description>Line Command</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Search and read or write</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Invalidate</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Push</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Clear</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LADSEL</name>
                     <description>Line Address Select</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Cache address</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Physical address</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LACC</name>
                     <description>Line access type</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Read</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCCSAR</name>
               <description>Cache search address register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>LGO</name>
                     <description>Initiate Cache Line Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Write: no effect. Read: no line command active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write: initiate line command indicated by bits CLCR[27:24]. Read: line command active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHYADDR</name>
                     <description>Physical Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCCCVR</name>
               <description>Cache read/write value register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Cache read/write Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCCRMR</name>
               <description>Cache regions mode register</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0xAA0FA000</resetValue>
               <fields>
                  <field>
                     <name>R15</name>
                     <description>Region 15 mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Non-cacheable</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Non-cacheable</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Write-through</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Write-back</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="R15" > <name>R14</name> <description>Region 14 mode</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R13</name> <description>Region 13 mode</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R12</name> <description>Region 12 mode</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R11</name> <description>Region 11 mode</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R10</name> <description>Region 10 mode</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R9</name> <description>Region 9 mode</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R8</name> <description>Region 8 mode</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R7</name> <description>Region 7 mode</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R6</name> <description>Region 6 mode</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R5</name> <description>Region 5 mode</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R4</name> <description>Region 4 mode</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R3</name> <description>Region 3 mode</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R2</name> <description>Region 2 mode</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R1</name> <description>Region 1 mode</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="R15" > <name>R0</name> <description>Region 0 mode</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
